INtype.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:apl="http://www.gecapital.jp/schema/ei/ito/apl">
   <soapenv:Header/>
   <soapenv:Body>
      <apl:aplUpd>
         <apl:aplUpdIn>
            <apl:apl_no>2112000033</apl:apl_no>
            <apl:collecttimes></apl:collecttimes>
            <apl:month_amtlease_amt></apl:month_amtlease_amt>
            <apl:cnt_amt>0</apl:cnt_amt>
            <apl:judge_flag>2</apl:judge_flag>
            <apl:updatedate></apl:updatedate>
            <apl:updatetime></apl:updatetime>
            <apl:updateuserid></apl:updateuserid>
            <apl:updateusername></apl:updateusername>
            <apl:updatestorecd></apl:updatestorecd>
            <apl:update_eigyousyo_cd>002205000</apl:update_eigyousyo_cd>
            <apl:recordversion>18</apl:recordversion>
            <apl:secondcomment></apl:secondcomment>
            <apl:deliveryschedule_dt>20220304</apl:deliveryschedule_dt>
            <apl:change_cls>3</apl:change_cls>
            <apl:amt_rt>1</apl:amt_rt>
            <apl:salescomment></apl:salescomment>
            <apl:autofax_button_status>2</apl:autofax_button_status>
            <apl:sales_recordversion></apl:sales_recordversion>
            <apl:agreement_flag>2</apl:agreement_flag>
            <apl:associatedsalestore_nm>TEST</apl:associatedsalestore_nm>
            <apl:associatedsupplier_nm_1>TEST</apl:associatedsupplier_nm_1>
            <apl:associatedsupplier_nm_2>TEST</apl:associatedsupplier_nm_2>
            <!--1 or more repetitions:-->
            <apl:apl_prptlist>
               <apl:property_no>001</apl:property_no>
               <apl:itomodel_cd>AAR002</apl:itomodel_cd>
               <apl:property_nm>金属検出機</apl:property_nm>
               <apl:maker_nm></apl:maker_nm>
               <apl:propertyprice>1000</apl:propertyprice>
               <apl:manufacturing_no></apl:manufacturing_no>
               <apl:propertymodel></apl:propertymodel>
               <apl:property_num>10</apl:property_num>
               <apl:instalationplace_cls></apl:instalationplace_cls>
               <apl:instalationpostal_cd></apl:instalationpostal_cd>
               <apl:instalationlocationdetail_nm></apl:instalationlocationdetail_nm>
               <apl:instalationprefecture_cd></apl:instalationprefecture_cd>
               <apl:instalationmunicipality_cd></apl:instalationmunicipality_cd>
               <apl:instalationpopularname_cd></apl:instalationpopularname_cd>
               <apl:instalationchome_cd></apl:instalationchome_cd>
               <apl:manufacturer_cd></apl:manufacturer_cd>
               <apl:manufacturer_department_cd></apl:manufacturer_department_cd>
               <apl:manufacturer_nm></apl:manufacturer_nm>
               <apl:second_hand_cls></apl:second_hand_cls>
               <apl:small_asset_kbn></apl:small_asset_kbn>
            </apl:apl_prptlist>
            <!--1 or more repetitions:-->
            <apl:appendedfilelist>
               <apl:appendedfile_cls></apl:appendedfile_cls>
               <apl:appendedfile_nm></apl:appendedfile_nm>
               <apl:appendedfile_comment></apl:appendedfile_comment>
               <apl:appendedfilelogin_date></apl:appendedfilelogin_date>
               <apl:appendedfilelogin_user></apl:appendedfilelogin_user>
               <apl:appendedfileserviceforsavefile_nm></apl:appendedfileserviceforsavefile_nm>
            </apl:appendedfilelist>
            <apl:denshikeiyakushintyokujyotai>02</apl:denshikeiyakushintyokujyotai>
            <apl:denshikeiyakusho_documentid>111</apl:denshikeiyakusho_documentid>
            <apl:quoteissue_append_flg>1</apl:quoteissue_append_flg>
            <apl:customer_mailaddress>xxx@163.com</apl:customer_mailaddress>
            <apl:customer_daihyousha_name>test</apl:customer_daihyousha_name>
            <apl:customer_yakusyoku_name>test</apl:customer_yakusyoku_name>
            <apl:denshikeiyaku_msg>test</apl:denshikeiyaku_msg>
            <apl:customer_busyo_name>test</apl:customer_busyo_name>
            <apl:djtr_keiyaku>1</apl:djtr_keiyaku>
            <apl:denshi_app_ymd>20220304</apl:denshi_app_ymd>
         </apl:aplUpdIn>
      </apl:aplUpd>
   </soapenv:Body>
</soapenv:Envelope>